Tekla Open API Reference for Tekla Structures 2025
Type Methods
The ConstructionObjectFilterExpressions.Type type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ConstructionObjectFilterExpressions.Type Class
Tekla.Structures.Filtering.Categories Namespace